results/test_json.txt

CLINK C:\Projects\bench>bombardier -c 10 -d 10s -l --print=i,r http://192.168.5.10:3001/json 
Bombarding http://192.168.5.10:3001/json for 10s using 10 connection(s)
Statistics        Avg      Stdev        Max
  Reqs/sec     34866.06    4484.40   39653.37
  Latency      285.79us   102.97us    30.00ms
  Latency Distribution
     50%     0.00us
     75%     1.00ms
     90%     1.00ms
     95%     1.00ms
     99%     1.00ms
  HTTP codes:
    1xx - 0, 2xx - 348674, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     7.75MB/s

CLINK C:\Projects\bench>sleep 10 

CLINK C:\Projects\bench>bombardier -c 10 -d 10s -l --print=i,r http://192.168.5.10:3002/json 
Bombarding http://192.168.5.10:3002/json for 10s using 10 connection(s)
Statistics        Avg      Stdev        Max
  Reqs/sec     34552.76    4125.64   38499.81
  Latency      288.32us    95.46us    31.00ms
  Latency Distribution
     50%     0.00us
     75%     1.00ms
     90%     1.00ms
     95%     1.00ms
     99%     1.00ms
  HTTP codes:
    1xx - 0, 2xx - 345453, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     6.39MB/s

CLINK C:\Projects\bench>sleep 10 

CLINK C:\Projects\bench>bombardier -c 100 -d 10s -l --print=i,r http://192.168.5.10:3001/json 
Bombarding http://192.168.5.10:3001/json for 10s using 100 connection(s)
Statistics        Avg      Stdev        Max
  Reqs/sec     51544.33    9901.33   57999.13
  Latency        1.94ms   466.74us    51.00ms
  Latency Distribution
     50%     2.00ms
     75%     2.00ms
     90%     3.00ms
     95%     3.00ms
     99%     6.00ms
  HTTP codes:
    1xx - 0, 2xx - 515295, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    11.45MB/s

CLINK C:\Projects\bench>sleep 10 

CLINK C:\Projects\bench>bombardier -c 100 -d 10s -l --print=i,r http://192.168.5.10:3002/json 
Bombarding http://192.168.5.10:3002/json for 10s using 100 connection(s)
Statistics        Avg      Stdev        Max
  Reqs/sec    100369.07   12907.76  112296.76
  Latency        0.99ms   185.00us    50.00ms
  Latency Distribution
     50%     1.00ms
     75%     1.00ms
     90%     1.00ms
     95%     1.00ms
     99%     2.00ms
  HTTP codes:
    1xx - 0, 2xx - 1003534, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    18.57MB/s

CLINK C:\Projects\bench>sleep 10 

CLINK C:\Projects\bench>bombardier -c 250 -d 10s -l --print=i,r http://192.168.5.10:3001/json 
Bombarding http://192.168.5.10:3001/json for 10s using 250 connection(s)
Statistics        Avg      Stdev        Max
  Reqs/sec     53514.18    6532.45   60550.61
  Latency        4.67ms     1.61ms   185.03ms
  Latency Distribution
     50%     4.00ms
     75%     5.00ms
     90%     6.00ms
     95%     7.00ms
     99%     9.00ms
  HTTP codes:
    1xx - 0, 2xx - 535072, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    11.88MB/s

CLINK C:\Projects\bench>sleep 10 

CLINK C:\Projects\bench>bombardier -c 250 -d 10s -l --print=i,r http://192.168.5.10:3002/json 
Bombarding http://192.168.5.10:3002/json for 10s using 250 connection(s)
Statistics        Avg      Stdev        Max
  Reqs/sec     94970.48   13711.12  106305.24
  Latency        2.63ms   257.14us    54.03ms
  Latency Distribution
     50%     3.00ms
     75%     3.00ms
     90%     3.00ms
     95%     3.00ms
     99%     5.00ms
  HTTP codes:
    1xx - 0, 2xx - 949243, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    17.56MB/s

CLINK C:\Projects\bench>sleep 10